#include <iostream>
using namespace std;

int main18() {
    cout << "018_指针-const修饰指针" << endl;
    cout << "----------------------------------------------------------------" << endl;

    cout << "1.常量指针" << endl;
    //1.常量指针
    //特点：<指针的指向> 可以修改，但是 <指针指向的值> 不可以修改
    int a = 10;
    int b = 20;
    const int* p = &a;  //常量指针
    cout << "*p = " << *p << endl;
    //*p = 20;  // 修改指针指向的值，报错
    p = &b;
    cout << "*p = " << *p << endl;
    cout << "----------------------------------------------------------------" << endl;


    //2.指针常量
    //特点：<指针的指向> 不可以修改，但是 <指针指向的值> 可以修改
    cout << "2.指针常量" << endl;
    int* const p2 = &a;
    *p2 = 30;
    //p2 = &b; // 修改指针的指向，报错
    cout << "*p2 = " << *p2 << endl;
    cout << "a = " << a << endl;
    cout << "----------------------------------------------------------------" << endl;


    //3.const即修饰指针，又修饰常量
    //特点：<指针的指向> 和 <指针指向的值> 都不可以修改
    cout << "3.const即修饰指针，又修饰常量" << endl;
    const int* const p3 = &a;
    //*p3 = 40; // 修改指针指向的值，报错 
    //p3 = &b; // 修改指针的指向，报错

    cout << "----------------------------------------------------------------" << endl;

    system("pause");
    return 0;
}
